app/controllers/charges_controller.rb

INSERT INTO "charges" ("amount", "payment_type", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 1000], ["payment_type", "oxxo"], ["company_id", 1], ["created_at", "2018-09-02 18:59:59.286566"], ["updated_at", "2018-09-02 18:59:59.286566"]]
---
  def create
    @company.charges.create!(charge_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_company
    @company = Company.find(params[:company_id])

SELECT "charges".* FROM "charges" WHERE "charges"."company_id" = ?  [["company_id", 1]]
---
  def set_company_charge
    @charge = @company.charges.find_by!(id: params[:id]) if @company