app/controllers/companies_controller.rb

  def create
    @company = Company.create!(company_params)
---
INSERT INTO "companies" ("name", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sin delantal"], ["category", "delivery"], ["created_at", "2018-09-02 18:56:57.691865"], ["updated_at", "2018-09-02 18:56:57.691865"]]