app/controllers/customers_controller.rb

  def create
    @company.customers.create!(customer_params)
---
INSERT INTO "customers" ("name", "email", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jane Doe"], ["email", "jane@gmail.com"], ["company_id", 1], ["created_at", "2018-09-03 02:38:59.515167"], ["updated_at", "2018-09-03 02:38:59.515167"]]

  def set_company
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_company_customer
    @customer = @company.customers.find_by!(id: params[:id]) if @company
---
SELECT "customers".* FROM "customers" WHERE "customers"."company_id" = ?  [["company_id", 2]]